АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыПропарки/алк_ВыгрузкаИзКамерыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамерыПропарки</name>
  <basedOn>Document.алк_ЗагрузкаВКамеруПропарки</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОстановкиКамеры</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеруПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдётРазгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияПропарки</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативноеВремяПропарки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ОперацииПропарки/алк_ОперацииПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПропарки</name>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Пропарка</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Готова</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыПропарки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзКамерыПропарки, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзКамерыПропарки);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		         		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиВКамерахПропарки", МассивРезультатовЗапроса[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВремениПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
   	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ОкончаниеВыгрузки КАК Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.Организация,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.КамераПропарки КАК Ячейка,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Объем
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки.Номенклатура КАК алк_ВыгрузкаИзКамерыПропаркиНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка = &Ссылка
		|	И НЕ алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ИдётРазгрузка
		|	И алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ВремяОстановкиКамеры < алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ОкончаниеВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК Период,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка КАК Регистратор,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Простой) КАК Статус,
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК ВремяНачала,
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК ВремяОкончанияПлан
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И (алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры < алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки
		|			ИЛИ алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры = алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки)
		|			И НЕ(алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка
		|					И алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры = алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Выгрузка),
		|	алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И (алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки < алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|			ИЛИ алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Простой),
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И НЕ алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка
		|	И алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки < алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	
		
	#Область СервисныеПроцедурыИФункции 
	
	
	#КонецОбласти

	
	
#КонецЕсли
